; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
;; rows=7, columns=3, robots=1, out_folder=training/easy, instance_id=38, seed=63

(define (problem floortile-38)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_1_1
    tile_1_2
    tile_1_3
    tile_2_1
    tile_2_2
    tile_2_3
    tile_3_1
    tile_3_2
    tile_3_3
    tile_4_1
    tile_4_2
    tile_4_3
    tile_5_1
    tile_5_2
    tile_5_3
    tile_6_1
    tile_6_2
    tile_6_3
    tile_7_1
    tile_7_2
    tile_7_3 - tile
    robot1 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_4_1)
    (robot-has robot1 black)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_3)
    (clear tile_1_1)
    (clear tile_1_2)
    (clear tile_1_3)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_3_1)
    (clear tile_3_2)
    (clear tile_3_3)
    (clear tile_4_2)
    (clear tile_4_3)
    (clear tile_5_1)
    (clear tile_5_2)
    (clear tile_5_3)
    (clear tile_6_1)
    (clear tile_6_2)
    (clear tile_6_3)
    (clear tile_7_1)
    (clear tile_7_2)
    (clear tile_7_3)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_4_1 tile_3_1 )
    (up tile_4_2 tile_3_2 )
    (up tile_4_3 tile_3_3 )
    (up tile_5_1 tile_4_1 )
    (up tile_5_2 tile_4_2 )
    (up tile_5_3 tile_4_3 )
    (up tile_6_1 tile_5_1 )
    (up tile_6_2 tile_5_2 )
    (up tile_6_3 tile_5_3 )
    (up tile_7_1 tile_6_1 )
    (up tile_7_2 tile_6_2 )
    (up tile_7_3 tile_6_3 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_3_1 tile_4_1 )
    (down tile_3_2 tile_4_2 )
    (down tile_3_3 tile_4_3 )
    (down tile_4_1 tile_5_1 )
    (down tile_4_2 tile_5_2 )
    (down tile_4_3 tile_5_3 )
    (down tile_5_1 tile_6_1 )
    (down tile_5_2 tile_6_2 )
    (down tile_5_3 tile_6_3 )
    (down tile_6_1 tile_7_1 )
    (down tile_6_2 tile_7_2 )
    (down tile_6_3 tile_7_3 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_4_1 tile_4_2 )
    (left tile_4_2 tile_4_3 )
    (left tile_5_1 tile_5_2 )
    (left tile_5_2 tile_5_3 )
    (left tile_6_1 tile_6_2 )
    (left tile_6_2 tile_6_3 )
    (left tile_7_1 tile_7_2 )
    (left tile_7_2 tile_7_3 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_4_2 tile_4_1 )
    (right tile_4_3 tile_4_2 )
    (right tile_5_2 tile_5_1 )
    (right tile_5_3 tile_5_2 )
    (right tile_6_2 tile_6_1 )
    (right tile_6_3 tile_6_2 )
    (right tile_7_2 tile_7_1 )
    (right tile_7_3 tile_7_2 ))
 (:goal  (and 
    (painted tile_1_1 white)
    (painted tile_1_2 black)
    (painted tile_1_3 white)
    (painted tile_2_1 black)
    (painted tile_2_2 white)
    (painted tile_2_3 black)
    (painted tile_3_1 white)
    (painted tile_3_2 black)
    (painted tile_3_3 white)
    (painted tile_4_1 black)
    (painted tile_4_2 white)
    (painted tile_4_3 black)
    (painted tile_5_1 white)
    (painted tile_5_2 black)
    (painted tile_5_3 white)
    (painted tile_6_1 black)
    (painted tile_6_2 white)
    (painted tile_6_3 black)
    (painted tile_7_1 white)
    (painted tile_7_2 black)
    (painted tile_7_3 white))))

; plan
1. (move_up robot1 tile_4_1 tile_5_1)
   deleted: (robot-at robot1 tile_4_1) (clear tile_5_1)
   added: (robot-at robot1 tile_5_1) (clear tile_4_1)
   goals met: 0 of 21
2. (move_up robot1 tile_5_1 tile_6_1)
   deleted: (robot-at robot1 tile_5_1) (clear tile_6_1)
   added: (robot-at robot1 tile_6_1) (clear tile_5_1)
   goals met: 0 of 21
3. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 0 of 21
4. (paint_up robot1 tile_7_1 tile_6_1 white)
   deleted: (clear tile_7_1)
   added: (painted tile_7_1 white)
   goals met: 1 of 21
5. (move_down robot1 tile_6_1 tile_5_1)
   deleted: (robot-at robot1 tile_6_1) (clear tile_5_1)
   added: (robot-at robot1 tile_5_1) (clear tile_6_1)
   goals met: 1 of 21
6. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 1 of 21
7. (paint_up robot1 tile_6_1 tile_5_1 black)
   deleted: (clear tile_6_1)
   added: (painted tile_6_1 black)
   goals met: 2 of 21
8. (move_right robot1 tile_5_1 tile_5_2)
   deleted: (robot-at robot1 tile_5_1) (clear tile_5_2)
   added: (robot-at robot1 tile_5_2) (clear tile_5_1)
   goals met: 2 of 21
9. (move_up robot1 tile_5_2 tile_6_2)
   deleted: (robot-at robot1 tile_5_2) (clear tile_6_2)
   added: (robot-at robot1 tile_6_2) (clear tile_5_2)
   goals met: 2 of 21
10. (paint_up robot1 tile_7_2 tile_6_2 black)
   deleted: (clear tile_7_2)
   added: (painted tile_7_2 black)
   goals met: 3 of 21
11. (move_right robot1 tile_6_2 tile_6_3)
   deleted: (robot-at robot1 tile_6_2) (clear tile_6_3)
   added: (robot-at robot1 tile_6_3) (clear tile_6_2)
   goals met: 3 of 21
12. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 3 of 21
13. (paint_up robot1 tile_7_3 tile_6_3 white)
   deleted: (clear tile_7_3)
   added: (painted tile_7_3 white)
   goals met: 4 of 21
14. (move_left robot1 tile_6_3 tile_6_2)
   deleted: (robot-at robot1 tile_6_3) (clear tile_6_2)
   added: (robot-at robot1 tile_6_2) (clear tile_6_3)
   goals met: 4 of 21
15. (move_down robot1 tile_6_2 tile_5_2)
   deleted: (robot-at robot1 tile_6_2) (clear tile_5_2)
   added: (robot-at robot1 tile_5_2) (clear tile_6_2)
   goals met: 4 of 21
16. (paint_up robot1 tile_6_2 tile_5_2 white)
   deleted: (clear tile_6_2)
   added: (painted tile_6_2 white)
   goals met: 5 of 21
17. (move_right robot1 tile_5_2 tile_5_3)
   deleted: (robot-at robot1 tile_5_2) (clear tile_5_3)
   added: (robot-at robot1 tile_5_3) (clear tile_5_2)
   goals met: 5 of 21
18. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 5 of 21
19. (paint_up robot1 tile_6_3 tile_5_3 black)
   deleted: (clear tile_6_3)
   added: (painted tile_6_3 black)
   goals met: 6 of 21
20. (move_down robot1 tile_5_3 tile_4_3)
   deleted: (robot-at robot1 tile_5_3) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_5_3)
   goals met: 6 of 21
21. (move_left robot1 tile_4_3 tile_4_2)
   deleted: (robot-at robot1 tile_4_3) (clear tile_4_2)
   added: (robot-at robot1 tile_4_2) (clear tile_4_3)
   goals met: 6 of 21
22. (paint_up robot1 tile_5_2 tile_4_2 black)
   deleted: (clear tile_5_2)
   added: (painted tile_5_2 black)
   goals met: 7 of 21
23. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 7 of 21
24. (move_left robot1 tile_4_2 tile_4_1)
   deleted: (robot-at robot1 tile_4_2) (clear tile_4_1)
   added: (robot-at robot1 tile_4_1) (clear tile_4_2)
   goals met: 7 of 21
25. (paint_up robot1 tile_5_1 tile_4_1 white)
   deleted: (clear tile_5_1)
   added: (painted tile_5_1 white)
   goals met: 8 of 21
26. (move_down robot1 tile_4_1 tile_3_1)
   deleted: (robot-at robot1 tile_4_1) (clear tile_3_1)
   added: (robot-at robot1 tile_3_1) (clear tile_4_1)
   goals met: 8 of 21
27. (move_right robot1 tile_3_1 tile_3_2)
   deleted: (robot-at robot1 tile_3_1) (clear tile_3_2)
   added: (robot-at robot1 tile_3_2) (clear tile_3_1)
   goals met: 8 of 21
28. (paint_up robot1 tile_4_2 tile_3_2 white)
   deleted: (clear tile_4_2)
   added: (painted tile_4_2 white)
   goals met: 9 of 21
29. (move_right robot1 tile_3_2 tile_3_3)
   deleted: (robot-at robot1 tile_3_2) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_3_2)
   goals met: 9 of 21
30. (move_up robot1 tile_3_3 tile_4_3)
   deleted: (robot-at robot1 tile_3_3) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_3_3)
   goals met: 9 of 21
31. (paint_up robot1 tile_5_3 tile_4_3 white)
   deleted: (clear tile_5_3)
   added: (painted tile_5_3 white)
   goals met: 10 of 21
32. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 21
33. (move_down robot1 tile_4_3 tile_3_3)
   deleted: (robot-at robot1 tile_4_3) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_4_3)
   goals met: 10 of 21
34. (paint_up robot1 tile_4_3 tile_3_3 black)
   deleted: (clear tile_4_3)
   added: (painted tile_4_3 black)
   goals met: 11 of 21
35. (move_down robot1 tile_3_3 tile_2_3)
   deleted: (robot-at robot1 tile_3_3) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_3_3)
   goals met: 11 of 21
36. (move_left robot1 tile_2_3 tile_2_2)
   deleted: (robot-at robot1 tile_2_3) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_2_3)
   goals met: 11 of 21
37. (paint_up robot1 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 12 of 21
38. (move_left robot1 tile_2_2 tile_2_1)
   deleted: (robot-at robot1 tile_2_2) (clear tile_2_1)
   added: (robot-at robot1 tile_2_1) (clear tile_2_2)
   goals met: 12 of 21
39. (move_up robot1 tile_2_1 tile_3_1)
   deleted: (robot-at robot1 tile_2_1) (clear tile_3_1)
   added: (robot-at robot1 tile_3_1) (clear tile_2_1)
   goals met: 12 of 21
40. (paint_up robot1 tile_4_1 tile_3_1 black)
   deleted: (clear tile_4_1)
   added: (painted tile_4_1 black)
   goals met: 13 of 21
41. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 13 of 21
42. (move_down robot1 tile_3_1 tile_2_1)
   deleted: (robot-at robot1 tile_3_1) (clear tile_2_1)
   added: (robot-at robot1 tile_2_1) (clear tile_3_1)
   goals met: 13 of 21
43. (paint_up robot1 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 14 of 21
44. (move_down robot1 tile_2_1 tile_1_1)
   deleted: (robot-at robot1 tile_2_1) (clear tile_1_1)
   added: (robot-at robot1 tile_1_1) (clear tile_2_1)
   goals met: 14 of 21
45. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 14 of 21
46. (paint_up robot1 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 15 of 21
47. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 15 of 21
48. (move_down robot1 tile_1_1 tile_0_1)
   deleted: (robot-at robot1 tile_1_1) (clear tile_0_1)
   added: (robot-at robot1 tile_0_1) (clear tile_1_1)
   goals met: 15 of 21
49. (paint_up robot1 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 16 of 21
50. (move_right robot1 tile_0_1 tile_0_2)
   deleted: (robot-at robot1 tile_0_1) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_1)
   goals met: 16 of 21
51. (move_up robot1 tile_0_2 tile_1_2)
   deleted: (robot-at robot1 tile_0_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_0_2)
   goals met: 16 of 21
52. (paint_up robot1 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 17 of 21
53. (move_right robot1 tile_1_2 tile_1_3)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_1_2)
   goals met: 17 of 21
54. (move_up robot1 tile_1_3 tile_2_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_1_3)
   goals met: 17 of 21
55. (paint_up robot1 tile_3_3 tile_2_3 white)
   deleted: (clear tile_3_3)
   added: (painted tile_3_3 white)
   goals met: 18 of 21
56. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 18 of 21
57. (move_down robot1 tile_2_3 tile_1_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_2_3)
   goals met: 18 of 21
58. (paint_up robot1 tile_2_3 tile_1_3 black)
   deleted: (clear tile_2_3)
   added: (painted tile_2_3 black)
   goals met: 19 of 21
59. (move_down robot1 tile_1_3 tile_0_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_1_3)
   goals met: 19 of 21
60. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 19 of 21
61. (paint_up robot1 tile_1_3 tile_0_3 white)
   deleted: (clear tile_1_3)
   added: (painted tile_1_3 white)
   goals met: 20 of 21
62. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 20 of 21
63. (move_left robot1 tile_0_3 tile_0_2)
   deleted: (robot-at robot1 tile_0_3) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_3)
   goals met: 20 of 21
64. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 21 of 21
